# <!-- 2) გააკეთეთ 30 მაგალითი შედარებით ოპერატორებზე. 
# 3) დაწერეთ პროგრამა, რომელიც იღებს ორი ადამიანის ასაკს და განსაზღვრავს ვინ არის უფროსი.

# ნაბიჯები:

# შესთავაზეთ მომხმარებელს შეიყვანოს პირველი პირის ასაკი.
# სთხოვეთ მომხმარებელს შეიყვანოს მეორე პირის ასაკი.
# შეადარეთ ორი ასაკი შედარების ოპერატორების გამოყენებით.
# გამოიტანეთ შეტყობინება, რომელიც მიუთითებს იმაზე, თუ ვინ არის უფროსი ან იმავე ასაკის. 
# 4) -->
print(3<5)
print(8==8)
print(10>8)
print(133<122)
print(100<101)
print(5<8)
print(11<21)
print(457==457)
print(122==122)
print(1234<12345)
print(122<2334)
print(4235>2344)
print(97==97)
print(965>675)
print(347<400)
print(9998<9999)
print(723==23)
print(76567>2323)
print(100000>99999)
print(121<122)
print(9541<9955)
print(200>123)
print(1212==1212)
print(2122>329)
print(10<12)
print(230>19)
print(777==777)
print(231<322)
print(233<234)
print(2342>1999)
print(1000>999)


human1=19
human2=21
print(human1<human2)


input_human1=input("how old are you> ")
input_human2=input("how old are you> ")
print(input_human1<input_human2)


